content/man/man1/oomctl.1.org
#+TITLE: Manpages - oomctl.1
* NAME
oomctl - Analyze the state stored in *systemd-oomd*

* SYNOPSIS
*oomctl* [OPTIONS...] {COMMAND}

* DESCRIPTION
*oomctl* may be used to get information about the various contexts read
in by the *systemd*(1) userspace out-of-memory (OOM) killer,
*systemd-oomd*(8).

* COMMANDS
The following commands are understood:

*dump*

#+begin_quote
Show the current state of the cgroups and system contexts stored by
*systemd-oomd*.

Added in version 247.

#+end_quote

* OPTIONS
The following options are understood:

*-h*, *--help*

#+begin_quote
Print a short help text and exit.

#+end_quote

*--version*

#+begin_quote
Print a short version string and exit.

#+end_quote

*--no-pager*

#+begin_quote
Do not pipe output into a pager.

#+end_quote

* EXIT STATUS
On success, 0 is returned, a non-zero failure code otherwise.

* SEE ALSO
*systemd*(1), *systemd-oomd.service*(8), *oomd.conf*(5)
