public/man/man1/oomctl.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>
        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - oomctl.1 | Technical Notes</title>

      <link rel="stylesheet" href="/css/main.min.a9ecaac9d4f7845fc2de4738f7709cab0bd1c3d19c3466fadd637a6987603257.css" integrity="sha256-qeyqydT3hF/C3kc493CcqwvRw9GcNGb63WN6aYdgMlc=" crossorigin="anonymous">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - oomctl.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>oomctl - Analyze the state stored in <strong>systemd-oomd</strong></p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p><strong>oomctl</strong> [OPTIONS…] {COMMAND}</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>oomctl</strong> may be used to get information about the various contexts read
in by the *systemd*(1) userspace out-of-memory (OOM) killer,
*systemd-oomd*(8).</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
COMMANDS
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>The following commands are understood:</p>
<p>
<strong>dump</strong></p>
<blockquote>
<p>Show the current state of the cgroups and system contexts stored by
<strong>systemd-oomd</strong>.</p>
<p>
Added in version 247.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
OPTIONS
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>The following options are understood:</p>
<p>
<strong>-h</strong>, <strong>–help</strong></p>
<blockquote>
<p>Print a short help text and exit.</p>
</blockquote>
<p>
<strong>–version</strong></p>
<blockquote>
<p>Print a short version string and exit.</p>
</blockquote>
<p>
<strong>–no-pager</strong></p>
<blockquote>
<p>Do not pipe output into a pager.</p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-6" class="outline-2">
<h2 id="headline-6">
EXIT STATUS
</h2>
<div id="outline-text-headline-6" class="outline-text-2">
<p>On success, 0 is returned, a non-zero failure code otherwise.</p>
</div>
</div>
<div id="outline-container-headline-7" class="outline-2">
<h2 id="headline-7">
SEE ALSO
</h2>
<div id="outline-text-headline-7" class="outline-text-2">
<p>*systemd*(1), *systemd-oomd.service*(8), *oomd.conf*(5)</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.95916b5b8c09add4922ea47e674b5da7fc4b6347a3e8c4e25e98b4b7d236080b.js" integrity="sha256-lZFrW4wJrdSSLqR&#43;Z0tdp/xLY0ej6MTiXpi0t9I2CAs=" crossorigin="anonymous"></script>
    </body>
</html>
